
-- this file configure the cloakrooms on the map

local cfg = {}

-- prepare surgeries customizations
local surgery_male = { model = "mp_m_freemode_01" }
local surgery_female = { model = "mp_f_freemode_01" }
local Saudi = { model = "ig_bankman" }
local Baby = { model = "a_f_m_beach_01" }
local Lacasa = { model = "Salvador Dali" }
local emergency_male = { model = "s_m_m_paramedic_01" }
local emergency_female = { model = "s_f_y_paramedic_01" }
local fbi_male = { model = "s_m_y_swat_01" }
local sheriff_male = { model = "s_m_y_sheriff_01"}
local sheriff_female = { model = "s_f_y_ranger_01"}
local hway_male = { model = "s_m_y_hwaycop_01"}
local VIPSKINS1 = { model = "ig_barry"}
local VIPSKINS2 = { model = "ig_bestmen"}
local VIPSKINS3 = { model = "ig_beverly"}
local VIPSKINS4 = { model = "ig_bride"}
local VIPSKINS5 = { model = "ig_casey"}
local VIPSKINS6 = { model = "ig_hunter"}
local VIPSKINS7 = { model = "ig_janet"}
local VIPSKINS8 = { model = "ig_jewelass"}
local VIPSKINS10 = { model = "a_m_m_Skidrow_01"}
local VIPSKINS11 = { model = "a_m_y_runner_01"}
local VIPSKINS12 = { model = "ig_josh"}
local VIPSKINS13 = { model = "s_m_y_blackops_01"}
local VIPSKINS14 = { model = "g_f_y_vagos_01"}
local VIPSKINS15 = { model = "DoctorStrange(Classic)"}
local VIPSKINS16 = { model = "IronMan_MK85"}
local VIPSKINS17 = { model = "NobleArabe"}
local VIPSKINS18 = { model = "patrick"}
local VIPSKINS19 = { model = "RayStantz"}
local VIPSKINS20 = { model = "T-5000"}
local VIPSKINS24 = { model = "Affleck"}
local VIPSKINS25 = { model = "alex_claws"}
local VIPSKINS26 = { model = "alex_fists"}
local VIPSKINS27 = { model = "alex_sword"}
local VIPSKINS28 = { model = "alexmercer"}
local VIPSKINS29 = { model = "anna"}
local VIPSKINS30 = { model = "Aquaman"}
local VIPSKINS31 = { model = "babygroot"}
local VIPSKINS32 = { model = "bilzerian"}
local VIPSKINS33 = { model = "Calamardo"}
local VIPSKINS34 = { model = "CatNoir"}
local VIPSKINS36 = { model = "CWFF"}
local VIPSKINS37 = { model = "deadshot"}
local VIPSKINS38 = { model = "DonaldTrump"}
local VIPSKINS39 = { model = "elsa"}
local VIPSKINS40 = { model = "ghostrider"}
local VIPSKINS41 = { model = "GOKUMUI"}
local VIPSKINS42 = { model = "Harambe"}
local VIPSKINS999 = { model = "HarleyQuinn"}
local VIPSKINS44 = { model = "Helena"}
local VIPSKINS45 = { model = "homer"}
local VIPSKINS46 = { model = "JackSparrow"}
local VIPSKINS47 = { model = "Joker"}
local VIPSKINS48 = { model = "jonsnow_GOT"}
local VIPSKINS49 = { model = "julia"}
local VIPSKINS50 = { model = "KAKASHISharingan"}
local VIPSKINS51 = { model = "kokoro2"}
local VIPSKINS52 = { model = "kotoha"}
local VIPSKINS53 = { model = "Lana"}
local VIPSKINS54 = { model = "lastorder"}
local VIPSKINS55 = { model = "Leo"}
local VIPSKINS56 = { model = "LioMessiCiv"}
local VIPSKINS57 = { model = "Logan"}
local VIPSKINS58 = { model = "luffy"}
local VIPSKINS59 = { model = "MaiT"}
local VIPSKINS60 = { model = "Marie"}
local VIPSKINS61 = { model = "midoriya_rh7"}
local VIPSKINS62 = { model = "mirai"}
local VIPSKINS63 = { model = "mizuki"}
local VIPSKINS64 = { model = "morty"}
local VIPSKINS66 = { model = "mugi"}
local VIPSKINS67 = { model = "ped"}
local VIPSKINS68 = { model = "PennyWise90"}
local VIPSKINS69 = { model = "PinkPanther"}
local VIPSKINS70 = { model = "rick"}
local VIPSKINS71 = { model = "rocco"}
local VIPSKINS72 = { model = "s_m_m_fibsec_01"}
local VIPSKINS73 = { model = "sayoko"}
local VIPSKINS74 = { model = "scarlet_witch"}
local VIPSKINS75 = { model = "shiho"}
local VIPSKINS76 = { model = "shizuka"}
local VIPSKINS77 = { model = "shrek"}
local VIPSKINS78 = { model = "skeleton"}
local VIPSKINS79 = { model = "Sonic"}
local VIPSKINS80 = { model = "SoraKH3"}
local VIPSKINS81 = { model = "SpiderMan2002"}
local VIPSKINS83 = { model = "STR_Naruto"}
local VIPSKINS84 = { model = "subaru"}
local VIPSKINS85 = { model = "tsubasa"}
local VIPSKINS86 = { model = "tsuruhime"}
local VIPSKINS87 = { model = "Tyrion"}
local VIPSKINS88 = { model = "u1"}
local VIPSKINS89 = { model = "u2"}
local VIPSKINS90 = { model = "u3"}
local VIPSKINS91 = { model = "u4"}
local VIPSKINS92 = { model = "u5"}
local VIPSKINS93 = { model = "u6"}
local VIPSKINS95 = { model = "u8"}
local VIPSKINS96 = { model = "u9"}
local VIPSKINS97 = { model = "u10"}
local VIPSKINS98 = { model = "u11"}
local VIPSKINS99 = { model = "u12"}
local VIPSKINS100 = { model = "umi"}
local VIPSKINS101 = { model = "val"}
local VIPSKINS102 = { model = "vanille"}
local VIPSKINS103 = { model = "vegetablue"}
local VIPSKINS104 = { model = "venom"}
local VIPSKINS105 = { model = "wanda"}
local VIPSKINS106 = { model = "WillSmith"}
local VIPSKINS107 = { model = "WinterSoldier"}
local VIPSKINS108 = { model = "x23"}
local VIPSKINS109 = { model = "X23_XForce"}
local VIPSKINS110 = { model = "yrk"}
local VIPSKINS111 = { model = "yrk2"}
local EMS11 = { model = "EMS11"}
local Ems4 = { model = "Ems4"}
local Ems5 = { model = "Ems5"}
local Ems6 = { model = "Ems6"}
local Ems7 = { model = "Ems7"}
local Ems8 = { model = "Ems8"}
local Ems9 = { model = "Ems9"}
local redskull = { model = "redskull"}
local omsw = { model = "omsw"}
local redskull_mfl7 = { model = "redskull_mfl7"}
local Joker1 = { model = "Joker1"}
local t7ryat = { model = "po7md69"} --لبس التحريات
local blackmask = { model = "blackmask"} --لبس التحريات
local GRobbie = { model = "GRobbie"} --لبس التحريات
local CID = { model = "CID"}
local AE1 = { model = "AE1"}
local AE2 = { model = "AE2"}
local def100 = { model = "def100"}
local AE3 = { model = "po3"}
local AE4 = { model = "AE4"}
local AE5 = { model = "AE5"}
local AE8 = { model = "AE8"}
local AE9 = { model = "AE9"}
local AE10 = { model = "AE10"}
local AE11 = { model = "AE11"}
local AE12 = { model = "AE12"}
local AE13 = { model = "AE13"}
local AE14 = { model = "AE14"}
local AE15 = { model = "AE15"}
local AE16 = { model = "AE16"}
local AE17 = { model = "AE17"}
local AbuDhabiPoliceChief = { model = "AbuDhabiPoliceChief"}
local DeputyCommanderofAbuDhabiPolice = { model = "DeputyCommanderofAbuDhabiPolice"}
local AE1Q = { model = "AE1Q"}
local AE2Q = { model = "AE2Q"}
local AE3Q = { model = "AE3Q"}
local AE4Q = { model = "AE4Q"}
local AE5Q = { model = "AE5Q"}
local AE6Q = { model = "AE6Q"}
local AE7Q = { model = "AE7Q"}
local AE8Q = { model = "AE8Q"}
local AE9Q = { model = "AE9Q"}
local AE10Q = { model = "AE10Q"}
local AE11Q = { model = "AE11Q"}
local AE12Q = { model = "AE12Q"}
local AE13Q = { model = "AE13Q"}
local AE14Q = { model = "AE14Q"}
local AE15Q = { model = "AE15Q"}
local AE16Q = { model = "AE16Q"}
local AE17Q = { model = "AE17Q"}

--s_m_m_paramedic_01
--s_f_y_scrubs_01
--mp_m_freemode_01
--mp_f_freemode_01


for i=0,19 do
  surgery_female[i] = {0,0}
  surgery_male[i] = {0,0}
end

-- cloakroom types (_config, map of name => customization)
--- _config:
---- permissions (optional)
---- not_uniform (optional): if true, the cloakroom will take effect directly on the player, not as a uniform you can remove
cfg.cloakroom_types = {
  ["police"] = {
    _config = { permissions = {"police.cloakroom"} },
    ["Male uniform"] = {
      [3] = {30,0},
      [4] = {25,2},
      [6] = {24,0},
      [8] = {58,0},
      [11] = {55,0},
      ["p2"] = {2,0}
    },
    ["Female uniform"] = {
      [3] = {35,0},
      [4] = {30,0},
      [6] = {24,0},
      [8] = {6,0},
      [11] = {48,0},
      ["p2"] = {2,0}
    }
  },
     ["NEP"] = {
    _config = { permissions = {"NEP.cloakroom"} },
    ["NEP-1"] = {
      [1] = {0,0},
      [3] = {4,0},
      [4] = {6,0},
      [6] = {1,0},
      [8] = {15,0},	
      [7] = {4,0},	
      [9] = {0,0},	
      [10] = {0,0},		   
      [11] = {5,0},
	  ["p0"] = {4,6},
	  ["p1"] = {0,0},
	   modelhash = 1885233650
	},
	["NEP-2"] = {
      [1] = {0,0},
      [3] = {4,0},
      [4] = {6,1},
      [6] = {1,0},
      [8] = {15,0},	
      [7] = {4,1},	
      [9] = {0,0},	
      [10] = {0,0},		   
      [11] = {5,1},
	  ["p0"] = {4,6},
	  ["p1"] = {0,0},
	   modelhash = 1885233650
    },
	["NEP-3"] = {
      [1] = {0,0},
      [3] = {4,0},
      [4] = {6,2},
      [6] = {1,0},
      [8] = {15,0},	
      [7] = {4,2},	
      [9] = {0,0},	
      [10] = {0,0},		   
      [11] = {5,2},
	  ["p0"] = {4,6},
	  ["p1"] = {0,0},
	   modelhash = 1885233650
    }
    },
  ["Lawyer"] = {
    _config = { permissions = {"Lawyer.cloakroom"} },
    ["Male uniform"] = {
	  [3] = {1,0},
	  [4] = {10,0},
	  [6] = {10,0},
	  [8] = {4,0},
	  [11] = {10,0},
	  ["p2"] = {-1,0}       
    },
    ["Female uniform"] = {
	  [3] = {0,0},
	  [4] = {37,0},
	  [6] = {13,0},
	  [8] = {21,1},
	  [11] = {24,3},
	  ["p2"] = {-1,0}
    }
  },
["MH1"] = {
    _config = { permissions = {"MH1.cloakroom"} },
    ["مسعف"] = {
	  [1] = {0,0},
      [3] = {0,0}, 
      [5] = {0,0}, 
      [4] = {8,0}, 
      [6] = {8,0},  
      [7] = {12,0},  
      [8] = {6,0},	
      [10] = {0,0},		   
      [11] = {15,0},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH2"] = {
    _config = { permissions = {"MH2.cloakroom"} },
    ["ممرض"] = {
	  [1] = {0,0},
      [3] = {0,0}, 
	  [5] = {0,0},
      [4] = {8,1}, 
      [6] = {8,0},  
      [7] = {12,1},  
      [8] = {6,1},	
      [10] = {0,0},		   
      [11] = {15,0},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH3"] = {
    _config = { permissions = {"MH3.cloakroom"} },
    ["مساعد دكتور"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [5] = {0,0}, 	  
      [4] = {9,0}, 
      [6] = {8,0},  
      [7] = {0,0},  
      [8] = {7,0},	
      [10] = {0,0},		   
      [11] = {15,0},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH4"] = {
    _config = { permissions = {"MH4.cloakroom"} },
    ["دكتور"] = {
	  [1] = {0,0},
      [3] = {0,0}, 
	  [5] = {0,0},
      [4] = {9,1}, 
      [6] = {8,0},  
	  [7] = {0,0},
      [8] = {7,1},	
      [10] = {0,0},		   
      [11] = {15,1},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH5"] = {
    _config = { permissions = {"MH5.cloakroom"} },
    ["جراح"] = {
	  [1] = {0,0},
      [3] = {0,0}, 
	  [5] = {0,0},
      [4] = {9,2}, 
      [6] = {8,0},  
	  [7] = {0,0},
      [8] = {7,2},	
      [10] = {0,0},		   
      [11] = {15,1},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH6"] = {
    _config = { permissions = {"MH6.cloakroom"} },
    ["استشاري"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {8,3},
	  [5] = {0,0},
      [6] = {9,0},
      [7] = {0,0},
	  [7] = {0,0},
      [8] = {8,0},	
      [10] = {0,0},		   
      [11] = {15,0},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH7"] = {
    _config = { permissions = {"MH7.cloakroom"} },
    ["اخصائي"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {8,5},
	  [5] = {0,0},
      [6] = {9,0},
      [7] = {0,0},
	  [7] = {0,0},
      [8] = {8,1},	
      [10] = {0,0},		   
      [11] = {15,0},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH8"] = {
    _config = { permissions = {"MH8.cloakroom"} },
    ["بروفيسور"] = {
      [1] = {0,0},
      [3] = {1,0},
      [4] = {3,0},
	  [5] = {0,0},
      [6] = {10,0},
      [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		   
      [11] = {0,0},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH9"] = {
    _config = { permissions = {"MH9.cloakroom"} },
    ["مدير المستشفى"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {8,6},
	  [5] = {0,0},
      [6] = {9,0},
      [7] = {0,0},
	  [7] = {0,0},
      [8] = {8,2},	
      [10] = {0,0},		   
      [11] = {15,0},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH11"] = {
    _config = { permissions = {"MH11.cloakroom"} },
    ["مسؤول الصحة"] = {
      [1] = {0,0},
      [3] = {4,0},
      [4] = {3,2},
	  [5] = {0,0},
      [6] = {10,0},
      [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		   
      [11] = {1,0},
	  ["p0"] = {-1,0},
	  modelhash = 1885233650
    }
	},
	["MH12"] = {
    _config = { permissions = {"MH12.cloakroom"} },
    ["وزير الصحة"] = {
      [1] = {0,0},
      [3] = {4,0},
      [4] = {3,1},
	  [5] = {0,0},
      [6] = {10,0},
      [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		   
      [11] = {4,0},
	  ["p0"] = {9,7},
	  modelhash = 1885233650
    }
	},
	["MH13"] = {
    _config = { permissions = {"MH13.cloakroom"} },
    ["نائب وزير الصحة"] = {
      [1] = {0,0},
      [3] = {4,0},
      [4] = {3,1},
	  [5] = {0,0},
      [6] = {10,0},
      [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		   
      [11] = {4,1},
	  ["p0"] = {9,7},
	  modelhash = 1885233650
    }
	},
    ["KING"] = {
    _config = { permissions = {"KING.cloakroom"} },
    ["اسود 1"] = {
      [1] = {0,0},
      [3] = {1,0},
      [4] = {11,6},
      [6] = {10,0},
      [8] = {15,0},
      [10] = {0,0},
      [11] = {11,0},
      ["p0"] = {9,6},
      modelhash = 1885233650
    },
    ["اسود 2"] = {
      [1] = {0,0},
      [3] = {1,0},
      [4] = {11,6},
      [6] = {10,0},
      [8] = {15,0},
      [10] = {0,0},
      [11] = {12,0},
      ["p0"] = {9,6},
      modelhash = 1885233650
	 },
    ["ابيض 1"] = {
      [1] = {0,0},
      [3] = {1,0},
      [4] = {11,7},
      [6] = {10,0},
      [8] = {15,0},
      [10] = {0,0},
      [11] = {11,1},
      ["p0"] = {9,7},
      modelhash = 1885233650
	 },
    ["ابيض 2"] = {
      [1] = {0,0},
      [3] = {1,0},
      [4] = {11,7},
      [6] = {10,0},
      [8] = {15,0},
      [10] = {0,0},
      [11] = {12,1},
      ["p0"] = {9,7},
      modelhash = 1885233650
    }
    },
     ["ws100"] = {
    _config = { permissions = {"ws100.cloakroom"} },
    ["قائد شرطة ابوظبي"] = AbuDhabiPoliceChief,
    },
	["ws101"] = {
    _config = { permissions = {"ws101.cloakroom"} },
    ["نائب قائد شرطة ابوظبي"] = DeputyCommanderofAbuDhabiPolice,
    },
    ["mr1"] = {
    _config = { permissions = {"mr1.cloakroom"} },
	["v جندي"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,0},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جندي"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,0},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr2"] = {
    _config = { permissions = {"mr2.cloakroom"} },
	[" v جندي اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,1},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جندي اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,1},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr3"] = {
    _config = { permissions = {"mr3.cloakroom"} },
	["v عريف"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,2},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["عريف"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,2},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr4"] = {
    _config = { permissions = {"mr4.cloakroom"} },
	["v وكيل رقيب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,3},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["وكيل رقيب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,3},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr5"] = {
    _config = { permissions = {"mr5.cloakroom"} },
	["v رقيب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,4},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["رقيب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,4},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr6"] = {
    _config = { permissions = {"mr6.cloakroom"} },
	["v رقيب اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,5},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["رقيب اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,5},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr7"] = {
    _config = { permissions = {"mr7.cloakroom"} },
	["v رئيس رقباء"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,6},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["رئيس رقباء"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,6},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
   ["mr8"] = {
    _config = { permissions = {"mr8.cloakroom"} },
	[" vملازم"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,7},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["ملازم"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,7},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr9"] = {
    _config = { permissions = {"mr9.cloakroom"} },
	["v ملازم اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  
      [11] = {212,8},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["ملازم اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,8},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,1},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr10"] = {
    _config = { permissions = {"mr10.cloakroom"} },
	["v نقيب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,9},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["نقيب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,9},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,2},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr11"] = {
    _config = { permissions = {"mr11.cloakroom"} },
	["v رائد"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {212,10},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["رائد"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,0},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,3},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,10},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr12"] = {
    _config = { permissions = {"mr12.cloakroom"} },
	["v مقدم"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {212,11},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["مقدم"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,11},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,4},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr13"] = {
    _config = { permissions = {"mr13.cloakroom"} },
	["v عقيد"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {212,12},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["عقيد"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,12},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,5},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr14"] = {
    _config = { permissions = {"mr14.cloakroom"} },
	["v عميد"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {212,13},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["عميد"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,13},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,6},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr15"] = {
    _config = { permissions = {"mr15.cloakroom"} },
	["v لواء"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {212,14},
	  ["p0"] = {3,1},
	  modelhash = 1885233650
    },
	["لواء"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,14},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,7},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr16"] = {
    _config = { permissions = {"mr16.cloakroom"} },
	["v فريق"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {212,15},
	  ["p0"] = {3,1},
	  modelhash = 1885233650
    },
	["فريق"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,15},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,8},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
	["mr17"] = {
    _config = { permissions = {"mr17.cloakroom"} },
	["v فريق اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  
      [11] = {212,16},
	  ["p0"] = {3,1},
	  modelhash = 1885233650
    },
	["فريق اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {31,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {213,16},
	  ["p0"] = {3,0},
	  modelhash = 1885233650
    },
	["جاكيت"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {24,1},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {25,9},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
    },
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,0},
      [6] = {1,0},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,0},
	  modelhash = 1885233650
	}
	},
   
   ["wd1"] = {
    _config = { permissions = {"wd1.cloakroom"} },
    ["+ جندي"] = {
      [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,0},
	  ["p0"] = {3,3},
	   modelhash = 1885233650
    },
	["جندي"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {10,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,0},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,1},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd2"] = {
    _config = { permissions = {"wd2.cloakroom"} },
    ["+ جندي اول"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,1},
	  ["p0"] = {3,3},
	   modelhash = 1885233650
    },
	["جندي اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {10,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,1},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,1},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd3"] = {
    _config = { permissions = {"wd3.cloakroom"} },
    ["+ عريف"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,2},
	  ["p0"] = {3,3},
	   modelhash = 1885233650
    },
	["عريف"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {10,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,2},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd4"] = {
    _config = { permissions = {"wd4.cloakroom"} },
    ["+ وكيل رقيب"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,3},
	  ["p0"] = {3,3},
	   modelhash = 1885233650
    },
	["وكيل رقيب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {10,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,3},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd5"] = {
    _config = { permissions = {"wd5.cloakroom"} },
    ["+ رقيب"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,4},
	  ["p0"] = {3,3},
	   modelhash = 1885233650
    },
	["رقيب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {10,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,4},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd6"] = {
    _config = { permissions = {"wd6.cloakroom"} },
    ["+ رقيب اول"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,5},
	  ["p0"] = {3,3},
	   modelhash = 1885233650
    },
	["رقيب اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {10,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,5},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd7"] = {
    _config = { permissions = {"wd7.cloakroom"} },
    ["+ رئيس رقباء"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,6},
	  ["p0"] = {3,3},
	   modelhash = 1885233650
    },
	["رئيس رقباء"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {10,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,6},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
   ["wd8"] = {
    _config = { permissions = {"wd8.cloakroom"} },
    ["+ ملازم"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,7},
	  ["p0"] = {3,3},
	   modelhash = 1885233650
    },
	["ملازم"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,7},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd9"] = {
    _config = { permissions = {"wd9.cloakroom"} },
    ["+ ملازم اول"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,8},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["ملازم اول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  
      [11] = {210,8},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd10"] = {
    _config = { permissions = {"wd10.cloakroom"} },
    ["+ نقيب"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,9},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["نقيب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,9},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd11"] = {
    _config = { permissions = {"wd11.cloakroom"} },
    ["+ رائد"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,10},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["رائد"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {210,10},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd12"] = {
    _config = { permissions = {"wd12.cloakroom"} },
    ["+ مقدم"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,11},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["مقدم"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {210,11},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd13"] = {
    _config = { permissions = {"wd13.cloakroom"} },
    ["+ عقيد"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,12},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["عقيد"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {210,12},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd14"] = {
    _config = { permissions = {"wd14.cloakroom"} },
    ["+ عميد"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,13},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["عميد"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {210,13},
	  ["p0"] = {3,3},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd15"] = {
    _config = { permissions = {"wd15.cloakroom"} },
    ["+ لواء"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,14},
	  ["p0"] = {3,5},
	  modelhash = 1885233650
    },
	["لواء"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		    
      [11] = {210,14},
	  ["p0"] = {3,5},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd16"] = {
    _config = { permissions = {"wd16.cloakroom"} },
    ["+ فريق"] = {
	  [1] = {0,0},
      [3] = {1,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {209,15},
	  ["p0"] = {3,5},
	  modelhash = 1885233650
    },
	["فريق"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {210,15},
	  ["p0"] = {3,5},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
	["wd17"] = {
    _config = { permissions = {"wd17.cloakroom"} },
    ["+ فريق أول"] = {
	  [1] = {0,0},
      [3] = {100,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  
      [11] = {209,16},
	  ["p0"] = {3,5},
	  modelhash = 1885233650
    },
	["فريق أول"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {15,0},	
      [10] = {0,0},		  
      [11] = {210,16},
	  ["p0"] = {3,5},
	  modelhash = 1885233650
    },
	["العمليات الخاصة"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {8,0},
      [8] = {15,0},	
      [10] = {0,0},		  	  
      [11] = {23,0},
	  ["p0"] = {5,0},
	  modelhash = 1885233650
	},
	["التدريب"] = {
	  [1] = {0,0},
      [3] = {0,0},
      [4] = {25,3},
      [6] = {1,1},
	  [7] = {0,0},
      [8] = {92,0},	
      [10] = {0,0},		  	  
      [11] = {24,0},
	  ["p0"] = {6,2},
	  modelhash = 1885233650
	}
	},
     ["wd100"] = {
    _config = { permissions = {"wd100.cloakroom"} },
    ["قائد القوات المسلحة"] = {
      [1] = {0,0},
      [3] = {1,0},
      [4] = {11,1},
      [6] = {10,0},
      [8] = {15,0},
      [10] = {0,0},
      [11] = {7,2},
      ["p0"] = {9,1},
      modelhash = 1885233650
    }
    },
	["wd101"] = {
    _config = { permissions = {"wd101.cloakroom"} },
    ["نائب قائد القوات المسلحة"] = {
      [1] = {0,0},
      [3] = {1,0},
      [4] = {11,1},
      [6] = {10,0},
      [8] = {15,0},
      [10] = {0,0},
      [11] = {7,3},
      ["p0"] = {9,1},
      modelhash = 1885233650
    }
    },
  ["ملابس خاصة"] = {
    _config = { permissions = {"Vip.cloakroom"} },
    ["VIP1"] = VIPSKINS1,
    ["VIP2"] = VIPSKINS2,
    ["VIP3"] = VIPSKINS3,
    ["VIP4"] = VIPSKINS4,
    ["VIP5"] = VIPSKINS5,
    ["VIP6"] = VIPSKINS6,
    ["VIP7"] = VIPSKINS7,
    ["VIP8"] = VIPSKINS8,
    ["VIP10"] = VIPSKINS10,
    ["VIP11"] = VIPSKINS11,
    ["VIP12"] = VIPSKINS12,
    ["VIP13"] = VIPSKINS13,
    ["VIP14"] = VIPSKINS14,
    ["VIP15"] = VIPSKINS15,
    ["VIP16"] = VIPSKINS16,
    ["VIP17"] = VIPSKINS17,
    ["VIP18"] = VIPSKINS18,
    ["VIP19"] = VIPSKINS19,
    ["VIP23"] = VIPSKINS23,
    ["VIP25"] = VIPSKINS25,
    ["VIP26"] = VIPSKINS26,
    ["VIP27"] = VIPSKINS27,
    ["VIP28"] = VIPSKINS28,
    ["VIP29"] = VIPSKINS29,
    ["VIP30"] = VIPSKINS30,
    ["VIP31"] = VIPSKINS31,
    ["VIP32"] = VIPSKINS32,
    ["VIP33"] = VIPSKINS33,
    ["VIP34"] = VIPSKINS34,
    ["VIP36"] = VIPSKINS36,
    ["VIP37"] = VIPSKINS37,
    ["VIP38"] = VIPSKINS38,
    ["VIP39"] = VIPSKINS39,
    ["VIP40"] = VIPSKINS40,
    ["VIP41"] = VIPSKINS41,
    ["VIP42"] = VIPSKINS42,
    ["VIPAE"] = VIPSKINS999,
    ["VIP44"] = VIPSKINS44,
    ["VIP45"] = VIPSKINS45,
    ["VIP46"] = VIPSKINS46,
    ["VIP47"] = VIPSKINS47,
    ["VIP48"] = VIPSKINS48,
    ["VIP49"] = VIPSKINS49,
    ["VIP50"] = VIPSKINS50,
    ["VIP51"] = VIPSKINS51,
    ["VIP52"] = VIPSKINS52,
    ["VIP53"] = VIPSKINS53,
    ["VIP54"] = VIPSKINS54,
    ["VIP55"] = VIPSKINS55,
    ["VIP56"] = VIPSKINS56,
    ["VIP57"] = VIPSKINS57,
    ["VIP58"] = VIPSKINS58,
    ["VIP59"] = VIPSKINS59,
    ["VIP60"] = VIPSKINS60,
    ["VIP61"] = VIPSKINS61,
    ["VIP62"] = VIPSKINS62,
    ["VIP63"] = VIPSKINS63,
    ["VIP64"] = VIPSKINS64,
    ["VIP66"] = VIPSKINS66,
    ["VIP67"] = VIPSKINS67,
    ["VIP68"] = VIPSKINS68,
    ["VIP69"] = VIPSKINS69,
    ["VIP70"] = VIPSKINS70,
    ["VIP71"] = VIPSKINS71,
    ["VIP72"] = VIPSKINS72,
    ["VIP73"] = VIPSKINS73,
    ["VIP74"] = VIPSKINS74,
    ["VIP75"] = VIPSKINS75,
    ["VIP76"] = VIPSKINS76,
    ["VIP77"] = VIPSKINS77,
    ["VIP78"] = VIPSKINS78,
    ["VIP79"] = VIPSKINS79,
    ["VIP80"] = VIPSKINS80,
    ["VIP81"] = VIPSKINS81,
    ["VIP83"] = VIPSKINS83,
    ["VIP84"] = VIPSKINS84,
    ["VIP85"] = VIPSKINS85,
    ["VIP86"] = VIPSKINS86,
    ["VIP87"] = VIPSKINS87,
    ["VIP88"] = VIPSKINS88,
    ["VIP89"] = VIPSKINS89,
    ["VIP90"] = VIPSKINS90,
    ["VIP91"] = VIPSKINS91,
    ["VIP92"] = VIPSKINS92,
    ["VIP93"] = VIPSKINS93,
    ["VIP95"] = VIPSKINS95,
    ["VIP96"] = VIPSKINS96,
    ["VIP97"] = VIPSKINS97,
    ["VIP98"] = VIPSKINS98,
    ["VIP99"] = VIPSKINS99,
    ["VIP100"] = VIPSKINS100,
    ["VIP101"] = VIPSKINS101,
    ["VIP102"] = VIPSKINS102,
    ["VIP103"] = VIPSKINS103,
    ["VIP104"] = VIPSKINS104,
    ["VIP105"] = VIPSKINS105,
    ["VIP106"] = VIPSKINS106,
    ["VIP107"] = VIPSKINS107,
    ["VIP108"] = VIPSKINS108,
    ["VIP109"] = VIPSKINS109,
    ["VIP110"] = VIPSKINS110,
    ["VIP111"] = VIPSKINS111,
	},
  ["BLACKMARKET"] = {
    _config = { permissions = {"BLACK.cloakroom"} },
    ["لاكاسا دي بابيل"] = La_Casa_de_Papel,
    ["warlock"] = Adam_Warlock,
    ["CJ"] = cjped,
    ["the red"] = redskull,
	},
	["جندي"] = {
    _config = { permissions = {"gwaat1.cloakroom"} },
    ["جندي القوات المسلحة"] = AE1Q,
	},
	["عريف القوات المسلحة"] = {
    _config = { permissions = {"gwaat2.cloakroom"} },
    ["عريف القوات المسلحة"] = AE2Q,
	},
	["عريف اول القوات المسلحة"] = {
    _config = { permissions = {"gwaat3.cloakroom"} },
    ["عريف اول القوات المسلحة"] = AE3Q,
	},
	["رقيب القوات المسلحة"] = {
    _config = { permissions = {"gwaat4.cloakroom"} },
    ["رقيب القوات المسلحة"] = AE4Q,
	},
	["رقيب اول القوات المسلحة"] = {
    _config = { permissions = {"gwaat5.cloakroom"} },
    ["رقيب اول القوات المسلحة"] = AE5Q,
	},
	["ملازم"] = {
    _config = { permissions = {"gwaat7.cloakroom"} },
    ["ملازم القوات المسلحة"] = AE8Q,
	},
	["ملازم اول"] = {
    _config = { permissions = {"gwaat8.cloakroom"} },
    ["ملازم اول القوات المسلحة"] = AE9Q,
	},
	["نقيب"] = {
    _config = { permissions = {"gwaat9.cloakroom"} },
    ["نقيب القوات المسلحة"] = AE10Q,
	},
	["رائد"] = {
    _config = { permissions = {"gwaat10.cloakroom"} },
    ["رائد القوات المسلحة"] = AE11Q,
	},
	["مقدم"] = {
    _config = { permissions = {"gwaat11.cloakroom"} },
    ["مقدم القوات المسلحة"] = AE12Q,
	},
	["عقيد"] = {
    _config = { permissions = {"gwaat12.cloakroom"} },
    ["عقيد القوات المسلحة"] = AE13Q,
	},
	["عميد"] = {
    _config = { permissions = {"gwaat13.cloakroom"} },
    ["عميد القوات المسلحة"] = AE14Q,
	},
	["لواء"] = {
    _config = { permissions = {"gwaat14.cloakroom"} },
    ["لواء القوات المسلحة"] = AE15Q,
	},
	["فريق"] = {
    _config = { permissions = {"gwaat15.cloakroom"} },
    ["فريق القوات المسلحة"] = AE16Q,
	},
	["فريق اول"] = {
    _config = { permissions = {"gwaat16.cloakroom"} },
    ["فريق اول القوات المسلحة"] = AE17Q,
	},
	["رئيس اركان القوات المسلحة"] = {
    _config = { permissions = {"gwaat17.cloakroom"} },
    ["رئيس اركان القوات المسلحة"] = AE17Q,
    },
	["قائد القوات المسلحة"] = {
    _config = { permissions = {"gwaat17.cloakroom"} },
    ["قائد القوات المسلحة"] = AE17Q,
	},
	["القائد الاعلى للقوات المسلحة"] = {
    _config = { permissions = {"gwaat17.cloakroom"} },
    ["القائد الاعلى للقوات المسلحة"] = AE17Q,
	},
  ["AE1"] = {
    _config = { permissions = {"po1.cloakroom"} },
    ["شرطي"] = AE1,
	["لبس المداهمات"] = omsw,
	},
  ["AE2"] = {
    _config = { permissions = {"po2.cloakroom"} },
    ["شرطي اول"] = AE2,
	["لبس المداهمات"] = omsw,
	},
  ["AE3"] = {
    _config = { permissions = {"po3.cloakroom"} },
    ["عريف"] = AE3,
	["لبس المداهمات"] = omsw,
	},
  ["AE4"] = {
    _config = { permissions = {"po4.cloakroom"} },
    ["رقيب"] = AE4,
	["لبس المداهمات"] = omsw,
	},
  ["AE5"] = {
    _config = { permissions = {"po5.cloakroom"} },
    ["رقيب اول"] = AE5,
	["لبس المداهمات"] = omsw,

	},
  ["AE8"] = {
    _config = { permissions = {"po6.cloakroom"} },
    ["ملازم"] = AE8,
	["لبس المداهمات"] = omsw,
	},
  ["AE9"] = {
    _config = { permissions = {"po7.cloakroom"} },
    ["ملازم اول"] = AE9,
	["لبس المداهمات"] = omsw,
	},
	["AE10"] = {
    _config = { permissions = {"po8888.cloakroom"} },
    ["نقيب"] = AE10,
	["لبس المداهمات"] = omsw,
	},
  ["AE11"] = {
    _config = { permissions = {"po9.cloakroom"} },
    ["رائد"] = AE11,
	["لبس المداهمات"] = omsw,
	},
  ["AE12"] = {
    _config = { permissions = {"po10.cloakroom"} },
    ["مقدم"] = AE12,
	["لبس المداهمات"] = omsw,
	},
  ["AE13"] = {
    _config = { permissions = {"po11.cloakroom"} },
    ["عقيد"] = AE13,
	["لبس المداهمات"] = omsw,
	},
  ["AE14"] = {
    _config = { permissions = {"po12.cloakroom"} },
    ["عميد"] = AE14,
	["لبس المداهمات"] = omsw,
	},
  ["AE15"] = {
    _config = { permissions = {"po13.cloakroom"} },
    ["لواء"] = AE15,
	["لبس المداهمات"] = omsw,
	},
  ["AE16"] = {
    _config = { permissions = {"po14.cloakroom"} },
    ["فريق"] = AE16,
	["لبس المداهمات"] = omsw,
	},
  ["AE17"] = {
    _config = { permissions = {"po15.cloakroom"} },
    ["فريق اول"] = AE17,
	["لبس المداهمات"] = omsw,
	},
	["DeputyCommanderofAbuDhabiPolice"] = {
    _config = { permissions = {"po16.cloakroom"} },
    ["نائب قائد شرطة ابوظبي"] = DeputyCommanderofAbuDhabiPolice,
	},
	["AbuDhabiPoliceChief"] = {
    _config = { permissions = {"po17.cloakroom"} },
    ["قائد شرطة ابوظبي"] = AbuDhabiPoliceChief,
	},
	["def100"] = {
    _config = { permissions = {"po19.cloakroom"} },
    ["شغب"] = def100,
	},
  ["s1"] = {
    _config = { permissions = {"s1.cloakroom"} },
    ["جندي امن الطرق"] = s1,
    },
  ["t7ryat"] = {
    _config = { permissions = {"FBI.vehicle"} },
    ["لبس التحريات"] = CID,
	},
   ["NIGGAS"] = {
    _config = { permissions = {"Nigger.cloakroom"} },
    ["توم سجينة"] = admin1_male,
    ["بهلول سجينة"] = admin2_male,
    ["هكسو سجينة"] = admin3_male,
    ["باقي اعزاء الفريجنا يابيي"] = admin4_male
  }
}

cfg.cloakrooms = {
  {"hdod", 1875.8786621094,1920.94921875,68.73265838623},
  {"NEP",-415.98565673828,1232.5347900391,327.10952758789},
  {"emergency",284.09020996094,-565.91271972656,34.783172607422},
  {"redskull",2836.7983398438,4724.8627929688,49.216327667236},
  {"GRobbie",3606.2221679688,3728.5805664063,29.689393997192},
  {"blackmask",3606.2072753906,3728.2946777344,29.689395904541},
  {"MH1",284.09020996094,-565.91271972656,34.783172607422}, 
  {"MH2",284.09020996094,-565.91271972656,34.783172607422},  
  {"MH3",284.09020996094,-565.91271972656,34.783172607422},  
  {"MH4",284.09020996094,-565.91271972656,34.783172607422}, 
  {"MH5",284.09020996094,-565.91271972656,34.783172607422},
  {"MH6",284.09020996094,-565.91271972656,34.783172607422},
  {"MH7",284.09020996094,-565.91271972656,34.783172607422},
  {"MH8",284.09020996094,-565.91271972656,34.783172607422},
  {"MH9",284.09020996094,-565.91271972656,34.783172607422},
  {"MH10",284.09020996094,-565.91271972656,34.783172607422},
  {"MH11",284.09020996094,-565.91271972656,34.783172607422},
  {"MH12",284.09020996094,-565.91271972656,34.783172607422},
  {"MH13",284.09020996094,-565.91271972656,34.783172607422},
  {"ملابس خاصة", 36.441165924072,-1054.0063476563,38.373435974121},
  --{"t7ryat", 5655.3969726563,-1077.359375,47.516422271729}, -- لبس التحريات
  {"AE1", 459.01037597656,-992.32800292969,30.689575195313},
  {"def100", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE1", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE2", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE2", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE3", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE3", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE4", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE4", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE5", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE5", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE8", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE8", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE9", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE9", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE10", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE10", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE11", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE11", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE12", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE12", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE13", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE13", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE14", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE14", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE15", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE15", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE16", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE16", 459.01037597656,-992.32800292969,30.689575195313},
  {"AE17", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"AE17", 459.01037597656,-992.32800292969,30.689575195313},
  {"DeputyCommanderofAbuDhabiPolice", 459.01037597656,-992.32800292969,30.689575195313},
  {"DeputyCommanderofAbuDhabiPolice", 5700.2470703125,-1148.6280517578,48.88720703125},
  {"s1", 1521.166015625,789.42260742188,77.605659484863},
  {"s2", 1521.166015625,789.42260742188,77.605659484863},
  {"s3", 1521.166015625,789.42260742188,77.605659484863},
  {"s4", 1521.166015625,789.42260742188,77.605659484863},
  {"s5", 1521.166015625,789.42260742188,77.605659484863},
  {"s6", 1521.166015625,789.42260742188,77.605659484863},
  {"s7", 1521.166015625,789.42260742188,77.605659484863},
  {"s8", 1521.166015625,789.42260742188,77.605659484863},
  {"s99", 1521.166015625,789.42260742188,77.605659484863},
  {"s10", 1521.166015625,789.42260742188,77.605659484863},
  {"s11", 1521.166015625,789.42260742188,77.605659484863},
  {"s12", 1521.166015625,789.42260742188,77.605659484863},
  {"s13", 1521.166015625,789.42260742188,77.605659484863},
  {"s14", 1521.166015625,789.42260742188,77.605659484863},
  {"s15", 1521.166015625,789.42260742188,77.605659484863},
  {"s16", 1521.166015625,789.42260742188,77.605659484863},
  {"s17", 1521.166015625,789.42260742188,77.605659484863},
  {"mr1", -817.91546630859,-1385.3162841797,15.895761489868}, 
  {"mr2", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr3", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr4", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr5", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr6", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr7", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr8", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr9", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr10", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr11", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr12", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr13", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr14", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr15", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr16", -817.91546630859,-1385.3162841797,15.895761489868},
  {"mr17", -817.91546630859,-1385.3162841797,15.895761489868},
  {"ws100",-817.91546630859,-1385.3162841797,15.895761489868},
  {"ws101",-817.91546630859,-1385.3162841797,15.895761489868},
  {"mr1", -822.36480712891,-1381.9105224609,15.895775794983}, 
  {"mr2", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr3", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr4", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr5", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr6", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr7", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr8", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr9", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr10", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr11", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr12", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr13", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr14", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr15", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr16", -822.36480712891,-1381.9105224609,15.895775794983},
  {"mr17", -822.36480712891,-1381.9105224609,15.895775794983},
  {"wd1", 1099.5367431641,333.28939819336,80.495956420898}, 
  {"wd2", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd3", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd4", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd5", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd6", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd7", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd8", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd9", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd10", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd11", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd12", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd13", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd14", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd15", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd16", 1099.5367431641,333.28939819336,80.495956420898},
  {"wd17", 1099.5367431641,333.28939819336,80.495956420898},
  {"ws100",-822.36480712891,-1381.9105224609,15.895775794983},
  {"ws101",-822.36480712891,-1381.9105224609,15.895775794983},
  {"wd100",1099.5367431641,333.28939819336,80.495956420898},
  {"wd101",1099.5367431641,333.28939819336,80.495956420898},
  --{"t7ryat", 3863.2072753906,1414.0137939453,27.142095565796}, 
  {"t7ryat", -598.58819580078,247.04890441895,46.520278930664}, 
  {"police", -448.53857421875,6009.2690429688,31.716375350952}, -- paleto
  {"Deputy", 1849.7268066406,3689.9221191406,34.267040252686}, -- sandy shores
  {"Deputy", -447.44305419922,6007.9516601563,31.716375350952}, -- paleto
  {"sheriff", 1849.7268066406,3689.9221191406,34.267040252686}, -- sandy shores
  {"sheriff", -447.44305419922,6007.9516601563,31.716375350952}, -- paleto
  {"Lawyer",-581.52008056641,-609.03277587891,35.850086212158},
  {"surgery",1849.7425,3686.5759,34.2670},----first spawn change skin
  {"surgery",75.3451766967773,-1392.86596679688,29.3761329650879},---skinsshops
  {"surgery",-700.089477539063,-151.570571899414,37.4151458740234},
  {"surgery",-170.416717529297,-296.563873291016,39.7332878112793},
  {"surgery",425.61181640625,-806.519897460938,29.4911422729492},
  {"surgery",-822.166687011719,-1073.58020019531,11.3281087875366},
  {"surgery",-1186.25744628906,-771.20166015625,17.3308639526367},
  {"UPS",78.672370910645,111.7912902832,81.168083190918},
  {"surgery",-1450.98388671875,-238.164260864258,49.8105850219727},
  {"surgery",4.44537162780762,6512.244140625,31.8778476715088},
  {"surgery",1693.91735839844,4822.66162109375,42.0631141662598},
  {"surgery",118.071769714355,-224.893646240234,54.5578384399414},
  {"surgery",620.459167480469,2766.82641601563,42.0881042480469},
  {"surgery",1196.89221191406,2710.220703125,38.2226066589355},
  {"ems100",244.1099395752,-1382.8720703125,39.534328460693},
  {"surgery",-3178.01000976563,1043.21044921875,20.8632164001465},
  {"surgery",-1101.15161132813,2710.8203125,19.1078643798828},
  {"NIGGAS",531.87963867188,-3132.3310546875,6.1267347335815},
  {"KING",-333.31698608398,1075.240234375,340.17697143555},
  {"BLACKMARKET",-2280.9436035156,224.55075073242,185.38174438477},
  {"BLACKMARKET",-2280.7702636719,219.67903137207,185.38175964355}
}

return cfg
